## Plan Result (prod)




<pre><code>Plan: 4 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_managed_disk.managed_disk[&#34;jenkins-ubuntu-arm&#34;]
  * azurerm_shared_image.shared_image[&#34;jenkins-ubuntu-arm&#34;]
  * azurerm_shared_image_version.image_version[&#34;jenkins-ubuntu-arm&#34;]
  * azurerm_snapshot.snapshot[&#34;jenkins-ubuntu-arm&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_managed_disk.managed_disk["jenkins-ubuntu-arm"] will be created
  + resource "azurerm_managed_disk" "managed_disk" {
      + create_option                 = "Empty"
      + disk_iops_read_only           = (known after apply)
      + disk_iops_read_write          = (known after apply)
      + disk_mbps_read_only           = (known after apply)
      + disk_mbps_read_write          = (known after apply)
      + disk_size_gb                  = 1
      + id                            = (known after apply)
      + location                      = "uksouth"
      + logical_sector_size           = (known after apply)
      + max_shares                    = (known after apply)
      + name                          = "jenkins-ubuntu-arm-disk"
      + public_network_access_enabled = true
      + resource_group_name           = "hmcts-image-gallery-rg"
      + source_uri                    = (known after apply)
      + storage_account_type          = "Standard_LRS"
      + tier                          = (known after apply)
    }

  # azurerm_shared_image.shared_image["jenkins-ubuntu-arm"] will be created
  + resource "azurerm_shared_image" "shared_image" {
      + gallery_name        = "hmcts"
      + hyper_v_generation  = "V2"
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "jenkins-ubuntu-arm"
      + os_type             = "Linux"
      + resource_group_name = "hmcts-image-gallery-rg"

      + identifier {
          + offer     = "jenkins-ubuntu-arm"
          + publisher = "hmcts"
          + sku       = "20.04-LTS"
        }
    }

  # azurerm_shared_image_version.image_version["jenkins-ubuntu-arm"] will be created
  + resource "azurerm_shared_image_version" "image_version" {
      + exclude_from_latest = false
      + gallery_name        = "hmcts"
      + id                  = (known after apply)
      + image_name          = "jenkins-ubuntu-arm"
      + location            = "uksouth"
      + name                = "1.0.0"
      + os_disk_snapshot_id = (known after apply)
      + resource_group_name = "hmcts-image-gallery-rg"

      + target_region {
          + name                   = "uksouth"
          + regional_replica_count = 1
          + storage_account_type   = "Standard_LRS"
        }
    }

  # azurerm_snapshot.snapshot["jenkins-ubuntu-arm"] will be created
  + resource "azurerm_snapshot" "snapshot" {
      + create_option       = "Copy"
      + disk_size_gb        = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "jenkins-ubuntu-arm-snapshot"
      + resource_group_name = "hmcts-image-gallery-rg"
      + source_uri          = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":18,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->